{
"published": [
    {
        "title": "Stackelberg Meta-Learning for Strategic Guidance in Multi-Robot Trajectory Planning",
        "authors": ["Yuhan Zhao", "Quanyan Zhu"],
        "hightlight": "Yuhan Zhao",
        "journal": "Accepted by IROS 2023",
        "abs": "Trajectory guidance requires a leader robotic agent to assist a follower robotic agent to cooperatively reach the target destination. However, planning cooperation becomes difficult when the leader serves a family of different followers and has incomplete information about the followers. There is a need for learning and fast adaptation of different cooperation plans. We develop a Stackelberg meta-learning approach to address this challenge. We first formulate the guided trajectory planning problem as a dynamic Stackelberg game to capture the leader-follower interactions. Then, we leverage meta-learning to develop cooperative strategies for different followers. The leader learns a meta-best-response model from a prescribed set of followers. When a specific follower initiates a guidance query, the leader quickly adapts to the follower-specific model with a small amount of learning data and uses it to perform trajectory guidance. We use simulations to elaborate that our method provides a better generalization and adaptation performance on learning followers' behavior than other learning approaches. The value and the effectiveness of guidance are also demonstrated by the comparison with zero guidance scenarios.",
        "bib": "@article{zhao2022stackelbergplan,<br> title={Stackelberg Meta-Learning for Strategic Guidance in Multi-Robot Trajectory Planning},<br> author={Zhao, Yuhan and Zhu, Quanyan},<br> journal={arXiv preprint arXiv:2211.13336},<br> year={2022} }", 
        "pdf": "https://arxiv.org/pdf/2211.13336.pdf",
        "code": "https://github.com/yuhan16/Stackelberg-Meta-Learning"
    },

    {
        "title": "Stackelberg Meta-Learning Based Control for Guided Cooperative LQG Systems",
        "authors": ["Yuhan Zhao", "Quanyan Zhu"],
        "hightlight": "Yuhan Zhao",
        "journal": "Accepted IFAC World Congress 2023",
        "abs": "Guided cooperation allows intelligent agents with heterogeneous capabilities to work together by following a leader-follower type of interaction. However, the associated control problem becomes challenging when the leader agent does not have complete information about follower agents. There is a need for learning and adaptation of cooperation plans. To this end, we develop a meta-learning-based Stackelberg game-theoretic framework to address the challenges in the guided cooperative control for linear systems. We first formulate the guided cooperation between agents as a dynamic Stackelberg game and use the feedback Stackelberg equilibrium as the agent-wise cooperation strategy. We further leverage meta-learning to address the incomplete information of follower agents, where the leader agent learns a meta-response model from a prescribed set of followers offline and adapts to a new coming cooperation task with a small amount of learning data. We use a case study in robot teaming to corroborate the effectiveness of our framework. Comparison with other learning approaches also shows that our learned cooperation strategy provides better transferability for different cooperation tasks.",
        "bib": "@article{zhao2022stackelberg,<br> title={Stackelberg Meta-Learning Based Control for Guided Cooperative LQG Systems},<br> author={Zhao, Yuhan and Zhu, Quanyan},<br> journal={arXiv preprint arXiv:2211.06512},<br> year={2022}}", 
        "pdf": "https://arxiv.org/pdf/2211.06512.pdf"
    },

    {
        "title": "Stackelberg Strategic Guidance for Heterogeneous Robots Collaboration",
        "authors": ["Yuhan Zhao", "Baichuan Huang", "Jingjin Yu", "Quanyan Zhu"],
        "hightlight": "Yuhan Zhao",
        "journal": "International Conference on Robotics and Automation (ICRA) 2022",
        "abs": "In this study, we explore the application of game theory, in particular Stackelberg games, to address the issue of effective coordination strategy generation for heterogeneous robots with one-way communication. To that end, focusing on the task of multi-object rearrangement, we develop a theoretical and algorithmic framework that provides strategic guidance for a pair of robot arms, a leader and a follower where the leader has a model of the follower's decision-making process, through the computation of a feedback Stackelberg equilibrium. With built-in tolerance of model uncertainty, the strategic guidance generated by our planning algorithm not only improves the overall efficiency in solving the rearrangement tasks, but is also robust to common pitfalls in collaboration, e.g., chattering. ",
        "bib": "@inproceedings{zhao2022stackelberg,<br> author={Zhao, Yuhan and Huang, Baichuan and Yu, Jingjin and Zhu, Quanyan},<br> booktitle={2022 International Conference on Robotics and Automation (ICRA)},<br> title={Stackelberg Strategic Guidance for Heterogeneous Robots Collaboration},<br> year={2022},<br> volume={},<br> number={},<br> pages={4922-4928},<br> doi={10.1109/ICRA46639.2022.9811678}}", 
        "pdf": "https://arxiv.org/pdf/2202.01877.pdf"
    },

    {
        "title": "Distributed and Resilient Planning-Control for Optimal LEO Satellite Constellation Coverage",
        "authors": ["Yuhan Zhao", "Quanyan Zhu"],
        "hightlight": "Yuhan Zhao",
        "journal": "American Control Conference (ACC), 2022",
        "abs": "Coverage services provided by LEO satellite constellations have served as the base platform for various space applications. However, the surge of space attacks such as physical and cyber attacks are greatly endangering the security of satellite constellations and the integrity of the coverage services. As repairs of satellites are challenging, a distributed protection mechanism is necessary to ensure the self-healing of the satellite constellation coverage from different attacks. To this end, this paper establishes a distributed framework to empower a resilient satellite constellation coverage design and control within a single orbit. Each satellite can make decisions individually to recover from adversarial and non-adversarial attacks and keep providing coverage service. We first provide the average coverage cost to measure the coverage performance. Then, we formulate the joint resilient coverage planning-control problem as a two-stage problem by decoupling the coverage planning and fuel-optimal control. A distributed algorithm is proposed to find the optimal coverage configuration. The multi-waypoint MPC methodology is adopted to steer satellites to the target configuration. Finally, we use a typical LEO satellite constellation as a case study to corroborate the results.",
        "bib": "@inproceedings{zhao2022distributed,<br> author={Zhao, Yuhan and Zhu, Quanyan},<br> booktitle={2022 American Control Conference (ACC)}, <br> title={Distributed and Resilient Planning-Control for Optimal LEO Satellite Constellation Coverage}, <br> year={2022},<br> volume={},<br> number={},<br> pages={1841-1846},<br> doi={10.23919/ACC53348.2022.9867536}}", 
        "pdf": "https://ieeexplore.ieee.org/document/9867536"
    },

    {
        "title": "The Role of Information Structures in Game-Theoretic Multi-Agent Learning",
        "authors": ["Tao Li", "Yuhan Zhao", "Quanyan Zhu"],
        "hightlight": "Yuhan Zhao",
        "journal": "Annual Reviews in Control, 2022",
        "abs": "Multi-agent learning (MAL) studies how agents learn to behave optimally and adaptively from their experience when interacting with other agents in dynamic environments. The outcome of a MAL process is jointly determined by all agents' decision-making. Hence, each agent needs to think strategically about others' sequential moves, when planning future actions. The strategic interactions among agents makes MAL go beyond the direct extension of single-agent learning to multiple agents. With the strategic thinking, each agent aims to build a subjective model of others decision-making using its observations. Such modeling is directly influenced by agents' perception during the learning process, which is called the information structure of the agent's learning. As it determines the input to MAL processes, information structures play a significant role in the learning mechanisms of the agents. This review creates a taxonomy of MAL and establishes a unified and systematic way to understand MAL from the perspective of information structures. We define three fundamental components of MAL: the information structure (i.e., what the agent can observe), the belief generation (i.e., how the agent forms a belief about others based on the observations), as well as the policy generation (i.e., how the agent generates its policy based on its belief). In addition, this taxonomy enables the classification of a wide range of state-of-the-art algorithms into four categories based on the belief-generation mechanisms of the opponents, including stationary, conjectured, calibrated, and sophisticated opponents. We introduce Value of Information (VoI) as a metric to quantify the impact of different information structures on MAL. Finally, we discuss the strengths and limitations of algorithms from different categories and point to promising avenues of future research.",
        "bib": "@article{li2022role, <br> title = {The role of information structures in game-theoretic multi-agent learning},<br> journal = {Annual Reviews in Control},<br> year = {2022},<br> pages = {296-314},<br> volume = {53},<br> issn = {1367-5788},<br> doi = {https://doi.org/10.1016/j.arcontrol.2022.03.003},<br> url = {https://www.sciencedirect.com/science/article/pii/S1367578822000086},<br> author = {Tao Li and Yuhan Zhao and Quanyan Zhu},<br> keywords = {Multi-agent learning, Information structures, Reinforcement learning, Belief generation, Game theory, Value of Information}}", 
        "pdf": "https://www.sciencedirect.com/science/article/pii/S1367578822000086"
    },

    {
        "title": "Herd Behaviors in Epidemics: A Dynamics-Coupled Evolutionary Games Approach",
        "authors": ["Shutian Liu", "Yuhan Zhao", "Quanyan Zhu"],
        "hightlight": "Yuhan Zhao",
        "journal": "Dynamic Games and Applications, 2022",
        "abs": "The recent COVID-19 pandemic has led to an increasing interest in the modeling and analysis of infectious diseases.  The pandemic has made a significant impact on the way we behave and interact in our daily life. The past year has witnessed a strong interplay between human behaviors and epidemic spreading. In this paper, we propose an evolutionary game-theoretic framework to study the coupled evolution of herd behaviors and epidemics. Our framework extends the classical degree-based mean-field epidemic model over complex networks by coupling it with the evolutionary game dynamics. The statistically equivalent individuals in a population choose their social activity intensities based on the fitness or the payoffs that depend on the state of the epidemics. Meanwhile, the spreading of the infectious disease over the complex network is reciprocally influenced by the players’ social activities. We analyze the coupled dynamics by studying the stationary properties of the epidemic for a given herd behavior and the structural properties of the game for a given epidemic process. The decisions of the herd turn out to be strategic substitutes. We formulate an equivalent finite-player game and an equivalent network to represent the interactions among the finite populations. We develop a structure-preserving approximation technique to study time-dependent properties of the joint evolution of the behavioral and epidemic dynamics. The resemblance between the simulated coupled dynamics and the real COVID-19 statistics in the numerical experiments indicates the predictive power of our framework.",
        "bib": "@article{liu2022role, <br> title = {Herd behaviors in epidemics: a dynamics-coupled evolutionary games approach},<br> journal = {Dynamic Games and Applications},<br> year = {2022},<br> pages = {183-213},<br> volume = {12},<br> issue = {1},<br> issn = {2153-0793},<br> doi = {10.1007/s13235-022-00433-3},<br> url = {https://doi.org/10.1007/s13235-022-00433-3},<br> author = {Shutian Liu and Yuhan Zhao and Quanyan Zhu}}", 
        "pdf": "https://link.springer.com/article/10.1007/s13235-022-00433-3"
    },

    {
        "title": "Understanding the Interplay Between Herd Behaviors and Epidemic Spreading Using Federated Evolutionary Games",
        "authors": ["Shutial Liu", "Yuhan Zhao", "Quanyan Zhu"],
        "hightlight": "Yuhan Zhao",
        "journal": "American Control Conference (ACC), 2022",
        "abs": "The recent COVID-19 pandemic has led to an increasing interest in the modeling and analysis of infectious diseases. Our social behaviors in the daily lives have been significantly affected by the pandemic. In this paper, we propose a federated evolutionary game-theoretic framework to study the coupling of herd behaviors changes and epidemics spreading. Our framework extends the classical degree-based mean-field epidemic model over complex networks by integrating it with the evolutionary game dynamics. The statistically equivalent individuals in a population choose their social activity intensities based on the fitness or the payoffs that depend on the state of the epidemics. Meanwhile, the spread of infectious diseases over the complex network is reciprocally influenced by the players’ social activities. We address the challenge of federated dynamics by breaking the analysis into the studies of the stationary properties of the epidemic for given herd behavior and the structural properties of the game for a given epidemic process. We use numerical experiments to show that our framework enables the prediction of the historical COVID-19 statistics.",
        "bib": "@inproceedings{liu2022understanding,<br> author={Liu, Shutian and Zhao, Yuhan and Zhu, Quanyan},<br> booktitle={2022 American Control Conference (ACC)}, <br> title={Understanding the Interplay Between Herd Behaviors and Epidemic Spreading Using Federated Evolutionary Games}, <br> year={2022},<br> volume={},<br> number={},<br> pages={593-598},<br> doi={10.23919/ACC53348.2022.9867809}}", 
        "pdf": "https://ieeexplore.ieee.org/document/9867809"
    },

    {
        "title": "Combating Ransomware in Internet of Things: A Games-in-Games Approach for Cross-Layer Cyber Defense and Security Investment",
        "authors": ["Yuhan Zhao", "Yunfei Ge", "Quanyan Zhu"],
        "hightlight": "Yuhan Zhao",
        "journal": "International Conference on Decision and Game Theory for Security (GameSec), 2021",
        "abs": "The recent surge in ransomware attacks has threatened many critical infrastructures such as oil pipeline systems, hospitals, and industrial Internet of Things (IoT). Ransomware is a cryptoviral extortion attack that involves two phases: the cyber infection of the malware and the financial transaction of the ransom payment. As the ransomware attackers are financially motivated, the protection of the infrastructure networked systems requires a cross-layer risk analysis that not only examines the vulnerability of the cyber system but also consolidates the economics of ransom payment. To this end, this paper establishes a two-player multi-phase and multi-stage game framework to model cyber and economic phases of a ransomware attack. We use a zero-sum Markov game to capture the multi-stage penetration of ransomware in the lateral movement. A sequential-move game is proposed to model the ransom payment interactions at the second phase. Two games are composed to form a multi-phase and multi-stage game-in-games (MPMS-GiG) that enables a holistic risk assessment of ransomware in networks and a cross-layer design of cyber defense and investment strategies to mitigate the attack. We provide a complete equilibrium characterization of ransomware game and design interdependent optimal strategies for cyber protection and ransom payment. We use prospect theory to analyze the impact of human factors on equilibrium strategies. Finally, we use a prototypical industrial IoT network as a case study to corroborate the results.",
        "bib": "@inproceedings{zhao2021combating,<br> title = {Combating ransomware in internet of things: a games-in-games approach for cross-layer cyber defense and security investment},<br> booktitle = {Decision and Game Theory for Security},<br> year = {2021},<br> pages = {208-228},<br> isbn = {978-3-030-90370-1},<br> doi = {https://doi.org/10.1007/978-3-030-90370-1_12},<br> author = {Yuhan Zhao and Yunfei Ge and Quanyan Zhu},<br> editor = {Bosansky, Branislav and Gonzalez, Cleotilde and Rass, Stefan and Sinha, Arunesh},<br> publisher = {Springer International Publishing},<br> address = {Cham}}", 
        "pdf": "https://link.springer.com/chapter/10.1007/978-3-030-90370-1_12"
    },

    {
        "title": "Combating Online Counterfeits: A Game-Theoretic Analysis of Cyber Supply Chain Ecosystem",
        "authors": ["Yuhan Zhao", "Quanyan Zhu"],
        "hightlight": "Yuhan Zhao",
        "journal": "International Conference on Decision and Game Theory for Security (GameSec), 2020",
        "abs": "Counterfeiting has been a pervasive threat to the security of supply chains. With the development of cyber technologies, traditional supply chains move their logistics to the cyberspace for better efficiency. However, counterfeiting threats still exist and may even cause worse consequences. It is imperative to find mitigating strategies to combat counterfeiting in the cyber supply chain. In this paper, we establish a games-in-games framework to capture the interactions of counterfeiting activities in the cyber supply chain. Specifically, the sellers in the cyber supply chain play a Stackelberg game with consumers, while sellers compete with each other by playing a Nash game. All sellers and consumers aim to maximize their utilities. We design algorithms to find the best response of all participants and analyze the equilibrium of the supply chain system. Finally, we use case studies to demonstrate the equilibrium behavior and propose effective anti-counterfeit strategies.",
        "bib": "@inproceedings{zhao2020combating,<br> title = {Combating online counterfeits: a game-theoretic analysis of cyber supply chain ecosystem},<br> booktitle = {Decision and Game Theory for Security},<br> year = {2020},<br> pages = {326-345},<br> isbn = {978-3-030-64793-3},<br> doi = {https://doi.org/10.1007/978-3-030-64793-3_18},<br> author = {Yuhan Zhao and Quanyan Zhu},<br> editor = {Zhu, Quanyan and Baras, John S. and Poovendran, Radha and Chen, Juntao},<br> publisher = {Springer International Publishing},<br> address = {Cham}}", 
        "pdf": "https://link.springer.com/chapter/10.1007/978-3-030-64793-3_18"
    }
    
], 

"preprints": [
    {
        "title": "Autonomous and Resilient Control for Optimal LEO Satellite Constellation Coverage Against Space Threats",
        "authors": ["Yuhan Zhao", "Quanyan Zhu"],
        "hightlight": "Yuhan Zhao",
        "journal": "Submitted to IEEE Transactions on Control Systems Technology",
        "abs": "LEO satellite constellation coverage has served as the base platform for various space applications. However, the rapidly evolving security environment such as orbit debris and adversarial space threats are greatly endangering the security of satellite constellation and integrity of the satellite constellation coverage. As on-orbit repairs are challenging, a distributed and autonomous protection mechanism is necessary to ensure the adaptation and self-healing of the satellite constellation coverage from different attacks. To this end, we establish an integrative and distributed framework to enable resilient satellite constellation coverage planning and control in a single orbit. Each satellite can make decisions individually to recover from adversarial and non-adversarial attacks and keep providing coverage service. We first provide models and methodologies to measure the coverage performance. Then, we formulate the joint resilient coverage planning-control problem as a two-stage problem. A coverage game is proposed to find the equilibrium constellation deployment for resilient coverage planning and an agent-based algorithm is developed to compute the equilibrium. The multi-waypoint Model Predictive Control (MPC) methodology is adopted to achieve autonomous self-healing control. Finally, we use a typical LEO satellite constellation as a case study to corroborate the results.",
        "bib": "@article{zhao2022autonomous,<br> title={Autonomous and Resilient Control for Optimal LEO Satellite Constellation Coverage Against Space Threats},<br> author={Zhao, Yuhan and Zhu, Quanyan},<br> journal={arXiv preprint arXiv:2203.02050},<br> year={2022}}", 
        "pdf": "https://arxiv.org/pdf/2203.02050.pdf"
    },

    {
        "title": "Multi-Agent Learning for Resilient Distributed Control Systems",
        "authors": ["Yuhan Zhao", "Quanyan Zhu"],
        "hightlight": "Yuhan Zhao",
        "journal": "Submitted as a Chapter for Power Grid Resilience: Theory and Applications",
        "abs": "Resilience describes a system's ability to function under disturbances and threats. Many critical infrastructures, including smart grids and transportation networks, are large-scale complex systems consisting of many interdependent subsystems. Decentralized architecture becomes a key resilience design paradigm for large-scale systems. In this book chapter, we present a multi-agent system (MAS) framework for distributed large-scale control systems and discuss the role of MAS learning in resiliency. This chapter introduces the creation of an artificial intelligence (AI) stack in the MAS to provide computational intelligence for subsystems to detect, respond, and recover. We discuss the application of learning methods at the cyber and physical layers of the system. The discussions focus on distributed learning algorithms for subsystems to respond to each other, and game-theoretic learning for them to respond to disturbances and adversarial behaviors. The book chapter presents a case study of distributed renewable energy systems to elaborate on the MAS architecture and its interface with the AI stack.",
        "bib": "@article{zhao2022multi,<br> title={Multi-Agent Learning for Resilient Distributed Control Systems},<br> author={Zhao, Yuhan and Rieger, Craig and Zhu, Quanyan},<br> journal={arXiv preprint arXiv:2208.05060},<br> year={2022}}", 
        "pdf": "https://arxiv.org/pdf/2208.05060.pdf"
    },

    {
        "title": "Integrated Cyber-Physical Resiliency for Power Grids under IoT-Enabled Dynamic Botnet Attacks",
        "authors": ["Yuhan Zhao", "Juntao Chen", "Quanyan Zhu"],
        "hightlight": "Yuhan Zhao",
        "journal": "Submitted to IEEE Transactions on Control Systems Technology",
        "abs": "The wide adoption of Internet of Things (IoT)-enabled energy devices improves the quality of life, but simultaneously, it enlarges the attack surface of the power grid system. The adversary can gain illegitimate control of a large number of these devices and use them as a means to compromise the physical grid operation, a mechanism known as the IoT botnet attack. This paper aims to improve the resiliency of cyber-physical power grids to such attacks. Specifically, we use an epidemic model to understand the dynamic botnet formation which facilitates the assessment of the cyber layer vulnerability of the grid. The attacker aims to exploit this vulnerability to enable a successful physical compromise, while the system operator's goal is to ensure a normal operation of the grid by mitigating cyber risks. We develop a cross-layer game-theoretic framework for strategic decision-making to enhance cyber-physical grid resiliency. The cyber-layer game guides the system operator on how to defend against the botnet attacker as the first layer of defense, while the dynamic game strategy at the physical layer further counteracts the adversarial behavior in real-time for improved physical resilience.",
        "bib": "",
        "code": "",
        "video": ""
    },

    {
        "title": " Stackelberg Game-Theoretic Trajectory Guidance for Multi-Robot Systems with Koopman Operator",
        "authors": ["Yuhan Zhao", "Quanyan Zhu"],
        "hightlight": "Yuhan Zhao",
        "journal": "Submitted to ICRA 2024",
        "abs": "Guided trajectory planning involves a leader robotic agent strategically directing a follower robotic agent to collaboratively reach a designated destination. However, this task becomes notably challenging when the leader lacks complete knowledge of the follower's decision-making model. There is a need for learning-based methods to effectively design the cooperative plan. To this end, we develop a Stackelberg game-theoretic approach based on Koopman operator to address the challenge. We first formulate the guided trajectory planning problem through the lens of a dynamic Stackelberg game. We then leverage Koopman operator theory to acquire a learning-based linear system model that approximates the follower's feedback dynamics. Based on this learned model, the leader devises a collision-free trajectory to guide the follower, employing receding horizon planning. We use simulations to elaborate the effectiveness of our approach in generating learning models that accurately predict the follower's multi-step behavior when compared to alternative learning techniques. Moreover, our approach successfully accomplishes the guidance task and notably reduces the leader's planning time to nearly half when contrasted with the model-based baseline method.",
        "bib": "",
        "pdf": "",
        "code": "https://github.com/yuhan16/Stackelberg-Koopman-Learning",
        "video": ""
    }
]
}